---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BeamSystem
source: html/93a6d44b-1f2a-b422-8aa9-7e70b6eca4bf.htm
---
# BeamSystem Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.